{
  "backend/main.mo": "Defines a Motoko actor for storing leads with a submit function and a query to return all leads.",
  "feature_evidence.json": "Lists implemented features, associated files, components, and requirement IDs for build traceability.",
  "frontend-file-summaries.txt": "Provides short descriptions of key frontend files and components for quick reference.",
  "frontend/index.css": "Tailwind base styles with extensive OKLCH design tokens and dark mode variables.",
  "frontend/index.html": "HTML entry with SEO‑optimized title and meta description plus Inter font loading.",
  "frontend/src/App.tsx": "Root React component rendering the Softevia landing page.",
  "frontend/src/components/leads/LeadCaptureDialog.tsx": "Modal dialog wrapper that displays the lead capture form with backdrop and close controls.",
  "frontend/src/components/leads/LeadCaptureForm.tsx": "Lead form handling input validation, submission, and success state display.",
  "frontend/src/components/marketing/CapabilitiesGrid.tsx": "Renders a grid of six AI and analytics capability cards with icons and descriptions.",
  "frontend/src/components/marketing/Footer.tsx": "Footer with branding, quick navigation links, CTA, and attribution.",
  "frontend/src/components/marketing/Header.tsx": "Responsive marketing header with navigation links, smooth scrolling, and demo request handling.",
  "frontend/src/components/marketing/HowItWorksFlow.tsx": "Displays a five‑step visual workflow with icons and descriptions for the product’s process.",
  "frontend/src/components/marketing/IndustriesGrid.tsx": "Renders a grid of industry cards with icons, titles, and short descriptions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, managing login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks interacting with the backend.",
  "frontend/src/hooks/useSubmitLead.ts": "Hook for submitting lead data through the backend actor with status and error handling.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables, themes, global styles, and utility gradients.",
  "frontend/src/main.tsx": "Application entry point initializing React, Query Client, Internet Identity provider, and global styles.",
  "frontend/src/pages/SofteviaLandingPage.tsx": "Landing page combining marketing sections, hero content, and lead capture dialog triggers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors using OKLCH variables, extended animations, shadows, fonts, and includes typography, container-queries, and animate plugins.",
  "project_state.json": "Defines the project’s state, goals, SEO requirements, features, and image needs for building a B2B SaaS landing page for Softevia."
}