{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Build a modern, high-conversion B2B SaaS landing page for Softevia targeting the SEO keyword “Market Research Technology in Europe,” positioning Softevia as an AI-powered market research technology provider (not a survey-based agency) with defined sections, CTAs, and SEO terms.",
  "architectural_notes": [
    "Landing page must naturally target primary SEO keyword “Market Research Technology in Europe” and include provided related keywords across sections.",
    "Design direction: clean modern SaaS layout with blue/purple gradient accents, AI/analytics-themed illustrations, and dashboard UI mockups.",
    "Position Softevia explicitly as a technology provider (AI market research, predictive analytics, BI, digital market intelligence platform) rather than a traditional survey-based research agency."
  ],
  "known_issues": [],
  "isFixRequest": false,
  "imageRequirements": "## Required Images\n- Abstract AI analytics illustration with European motif (softevia-hero-illustration.dim_1400x900.png)\n- SaaS dashboard UI mockup showing charts, KPIs, and filters (softevia-dashboard-mockup.dim_1600x1000.png)\n- Set of 6 minimal line icons for capabilities (insights, customers, benchmarking, predictive, BI, platform) in a consistent style (softevia-capability-icons.dim_512x512.png)",
  "existing_features": [
    {
      "id": "feature-create-a-single-page-modern-high-conversion-b2b-saas-landing-page-for-softevia-with-a-clean-professional-enterprise-look-using-blue-and-purple-gradient-accents-plus-ai-analytics-themed-visuals",
      "title": "Create a single-page, modern, high-conversion B2B SaaS landing page for “Softevia” with a clean, professional enterprise look using blue and purple gradient accents, plus AI/analytics-themed visuals.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-the-exact-page-structure-and-section-content-specified-by-the-user-with-user-facing-text-in-english-and-with-the-h1-exactly-market-research-technology-in-europe",
      "title": "Implement the exact page structure and section content specified by the user, with user-facing text in English and with the H1 exactly: “Market Research Technology in Europe”.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-add-conversion-focused-ctas-wire-the-request-a-demo-and-speak-with-an-expert-ctas-to-open-a-modal-or-dedicated-section-with-a-lead-capture-form-validate-inputs-and-show-a-clear-success-state-after-submission",
      "title": "Add conversion-focused CTAs: wire the “Request a Demo” and “Speak with an Expert” CTAs to open a modal (or dedicated section) with a lead capture form, validate inputs, and show a clear success state after submission.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-optimize-the-landing-page-for-on-page-seo-targeting-the-exact-keyword-market-research-technology-in-europe-by-adding-appropriate-document-title-meta-description-and-visible-keyword-usage-across-headings-body-while-keeping-language-natural-also-include-the-provided-related-keywords-across-the-page-content",
      "title": "Optimize the landing page for on-page SEO targeting the exact keyword “Market Research Technology in Europe” by adding appropriate document title, meta description, and visible keyword usage across headings/body while keeping language natural; also include the provided related keywords across the page content.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "feature-add-a-polished-navigation-header-and-footer-suitable-for-a-b2b-saas-landing-page-with-smooth-scroll-to-sections-and-persistent-access-to-primary-cta-s",
      "title": "Add a polished navigation/header and footer suitable for a B2B SaaS landing page, with smooth scroll to sections and persistent access to primary CTA(s).",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "feature-add-and-render-required-static-image-assets-illustrations-and-dashboard-mockups-under-frontend-public-assets-generated-and-integrate-them-into-relevant-sections-hero-and-or-how-it-works-solutions-with-proper-alt-text",
      "title": "Add and render required static image assets (illustrations and dashboard mockups) under frontend/public/assets/generated and integrate them into relevant sections (Hero and/or How it Works / Solutions) with proper alt text.",
      "reqIds": [
        "REQ-7"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Create Softevia B2B SaaS landing page (content + layout) optimized for the SEO keyword “Market Research Technology in Europe,” including specified sections (hero, evolution, about, 6-feature grid, why choose, industries grid, how it works flow, final CTA) and keyword integration.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Implement backend lead storage in the single Motoko actor: store lead submissions (timestamp, intent, name, email, company, message) and expose a method for the frontend to submit leads.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Softevia",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}